function: query
endpoint: wss://cjoakim-cosmos-graph1.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: knows
query: g.V('nm0000210').out('knows')
--- result_below ---
{
  "qname": "knows",
  "query": "g.V('nm0000210').out('knows')",
  "result_count": 28,
  "result": [
    {
      "id": "nm0000215",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "4cab6ffd-2d20-40df-ae97-d15b3977a397",
            "value": "Susan Sarandon"
          }
        ]
      }
    },
    {
      "id": "nm0000243",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "14a6ec95-5164-455d-b184-c52a732431c1",
            "value": "Denzel Washington"
          }
        ]
      }
    },
    {
      "id": "nm0000245",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "db9ef69d-13ce-437c-a7e8-9b4e93a3bdfe",
            "value": "Robin Williams"
          }
        ]
      }
    },
    {
      "id": "nm0000287",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "55083ab3-3b78-4d09-bf2a-59a957fc09dd",
            "value": "William Baldwin"
          }
        ]
      }
    },
    {
      "id": "nm0000345",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "38598b97-e525-4849-8a6d-ee4f383e9fda",
            "value": "Billy Crystal"
          }
        ]
      }
    },
    {
      "id": "nm0000349",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "fb9e763a-0b3d-48cf-9481-23cfc48486e9",
            "value": "Joan Cusack"
          }
        ]
      }
    },
    {
      "id": "nm0000352",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "ba98b357-6c3a-4aed-9a9e-aa4be6740240",
            "value": "Vincent DOnofrio"
          }
        ]
      }
    },
    {
      "id": "nm0000354",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "f4ecaf52-d4e9-466b-98f3-1dec08963d5a",
            "value": "Matt Damon"
          }
        ]
      }
    },
    {
      "id": "nm0000379",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "09e8821c-17ac-4add-bc67-71abddece9cf",
            "value": "Kirsten Dunst"
          }
        ]
      }
    },
    {
      "id": "nm0000380",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "65815a54-7c01-4132-a945-9b290cf7bb03",
            "value": "Robert Duvall"
          }
        ]
      }
    },
    {
      "id": "nm0000391",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "d06a72ca-9f80-4dae-8150-4160830d4412",
            "value": "Rupert Everett"
          }
        ]
      }
    },
    {
      "id": "nm0000398",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "9ac3dfb9-9fb1-4c7f-8fc7-904dcaf81843",
            "value": "Sally Field"
          }
        ]
      }
    },
    {
      "id": "nm0000424",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "165b17a4-8f01-43fb-b349-83b3c6feb883",
            "value": "Hugh Grant"
          }
        ]
      }
    },
    {
      "id": "nm0000438",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "3ed8cb40-7579-4627-9fc4-070e95dfe4f7",
            "value": "Ed Harris"
          }
        ]
      }
    },
    {
      "id": "nm0000443",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "2d22489c-3d5e-4fdf-9464-201bcd901abb",
            "value": "Goldie Hawn"
          }
        ]
      }
    },
    {
      "id": "nm0000450",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "6d8833db-6c2b-4076-ae37-2b3afa933769",
            "value": "Philip Seymour Hoffman"
          }
        ]
      }
    },
    {
      "id": "nm0000496",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "d247bf94-82d0-46f0-bffa-18e79e941872",
            "value": "Juliette Lewis"
          }
        ]
      }
    },
    {
      "id": "nm0000511",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "a92c54f6-5337-414b-ad3c-c17563240fa8",
            "value": "Shirley MacLaine"
          }
        ]
      }
    },
    {
      "id": "nm0000518",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "f223b747-8245-4b09-a43e-2bdada92d472",
            "value": "John Malkovich"
          }
        ]
      }
    },
    {
      "id": "nm0000551",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "18883869-4061-40e0-bc3a-49282245b9b5",
            "value": "Dermot Mulroney"
          }
        ]
      }
    },
    {
      "id": "nm0000553",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "002edcd7-6453-4a5f-8295-16cc88d7f326",
            "value": "Liam Neeson"
          }
        ]
      }
    },
    {
      "id": "nm0000560",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "b5bbcd8c-b4fe-4e95-9eff-32d67573d64e",
            "value": "Nick Nolte"
          }
        ]
      }
    },
    {
      "id": "nm0000598",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "b024067a-596a-4142-bb6e-c6e32b8f76aa",
            "value": "Dennis Quaid"
          }
        ]
      }
    },
    {
      "id": "nm0000624",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "2ec8b7e0-8467-4313-a4a5-e56cd1acfa2e",
            "value": "Laura San Giacomo"
          }
        ]
      }
    },
    {
      "id": "nm0000658",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "b8ef5515-caed-4c89-8120-6c2ba8bd5ef9",
            "value": "Meryl Streep"
          }
        ]
      }
    },
    {
      "id": "nm0000662",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "3d88971a-183f-46c6-8da7-94e5e9a651ff",
            "value": "Kiefer Sutherland"
          }
        ]
      }
    },
    {
      "id": "nm0000666",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "789b8503-20ba-4b77-8190-6058ddb8706d",
            "value": "Lili Taylor"
          }
        ]
      }
    },
    {
      "id": "nm0000754",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "43d902e1-88c4-4d94-a637-3280eac2d37e",
            "value": "Kevin Anderson"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_knows_1520765450.json
