function: query
endpoint: wss://cjoakim-cosmos-graph1.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: edges
query: g.V('nm0001742').bothE()
--- result_below ---
{
  "qname": "edges",
  "query": "g.V('nm0001742').bothE()",
  "result_count": 13,
  "result": [
    {
      "id": "0fdf9928-14f6-40de-b50b-5e130a65fa2c",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0087277",
      "outV": "nm0001742",
      "properties": {
        "title": "Footloose"
      }
    },
    {
      "id": "9ae524fb-3e44-4976-a5f2-0f0cbb9e9803",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001848",
      "outV": "nm0001742",
      "properties": {
        "title": "Footloose"
      }
    },
    {
      "id": "ebceb373-4340-49f8-a092-f3afd76a709d",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000102",
      "outV": "nm0001742",
      "properties": {
        "title": "Footloose"
      }
    },
    {
      "id": "f619e919-6b82-478c-b3fc-5b89eb127d29",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000158",
      "outV": "nm0001742",
      "properties": {
        "title": "The Man with One Red Shoe"
      }
    },
    {
      "id": "7d300c95-c34e-4e65-bce0-38b6b78faf6c",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001056",
      "outV": "nm0001742",
      "properties": {
        "title": "The Man with One Red Shoe"
      }
    },
    {
      "id": "2ed4157b-61be-4120-8193-e83167f7a0b3",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001164",
      "outV": "nm0001742",
      "properties": {
        "title": "The Man with One Red Shoe"
      }
    },
    {
      "id": "db3cc65a-bd89-4be9-8a82-5b617fc805f1",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001475",
      "outV": "nm0001742",
      "properties": {
        "title": "Footloose"
      }
    },
    {
      "id": "dec326fe-0f67-4f34-b285-7285ae227b9c",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0000102",
      "properties": {
        "title": "Footloose"
      }
    },
    {
      "id": "e0c6a7a7-5d10-41ed-84ed-7df9187a0005",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0000158",
      "properties": {
        "title": "The Man with One Red Shoe"
      }
    },
    {
      "id": "2576b480-6266-45d3-861e-48d6491eb172",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001056",
      "properties": {
        "title": "The Man with One Red Shoe"
      }
    },
    {
      "id": "4d11b684-143e-4987-b092-bdc714ec96ae",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001164",
      "properties": {
        "title": "The Man with One Red Shoe"
      }
    },
    {
      "id": "fc584521-be45-40f9-9c67-587c1ee9b050",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001475",
      "properties": {
        "title": "Footloose"
      }
    },
    {
      "id": "60cce84e-f6d7-44ed-87e7-a9bebdc91e18",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001848",
      "properties": {
        "title": "Footloose"
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_edges_1520765446.json
