function: query
endpoint: wss://cjoakim-cosmos-graph1.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: knows
query: g.V('nm0001742').out('knows')
--- result_below ---
{
  "qname": "knows",
  "query": "g.V('nm0001742').out('knows')",
  "result_count": 6,
  "result": [
    {
      "id": "nm0001848",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "9751d39b-6dd5-4999-a9c6-3a1d9714f805",
            "value": "Dianne Wiest"
          }
        ]
      }
    },
    {
      "id": "nm0000102",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "0a414d67-4be1-48c2-8ab6-289e269182ed",
            "value": "Kevin Bacon"
          }
        ]
      }
    },
    {
      "id": "nm0000158",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "b63169ef-8189-441d-8d6f-c405147b42c9",
            "value": "Tom Hanks"
          }
        ]
      }
    },
    {
      "id": "nm0001056",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "ddeb4a54-453d-40f4-a3de-363c1be581f4",
            "value": "Dabney Coleman"
          }
        ]
      }
    },
    {
      "id": "nm0001164",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "c755176f-44c1-4bf7-bc8b-c8a1f70c0693",
            "value": "Charles Durning"
          }
        ]
      }
    },
    {
      "id": "nm0001475",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "9201dd0d-7123-4a00-b1ce-9e83a4c6cf10",
            "value": "John Lithgow"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_knows_1520765455.json
