function: query
endpoint: wss://cjoakim-cosmos-graph1.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: path
query: g.V('nm0000152').repeat(out().simplePath()).until(hasId('nm0000210')).path().limit(3)
--- result_below ---
{
  "qname": "path",
  "query": "g.V('nm0000152').repeat(out().simplePath()).until(hasId('nm0000210')).path().limit(3)",
  "result_count": 3,
  "result": [
    {
      "labels": [
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "39333657-057a-40d9-ad15-3527084e8ebb",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000210",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "ad7a1362-37a8-43c7-8985-abb49394eb46",
                "value": "Julia Roberts"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "39333657-057a-40d9-ad15-3527084e8ebb",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000215",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "4cab6ffd-2d20-40df-ae97-d15b3977a397",
                "value": "Susan Sarandon"
              }
            ]
          }
        },
        {
          "id": "nm0000210",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "ad7a1362-37a8-43c7-8985-abb49394eb46",
                "value": "Julia Roberts"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "39333657-057a-40d9-ad15-3527084e8ebb",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000349",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "fb9e763a-0b3d-48cf-9481-23cfc48486e9",
                "value": "Joan Cusack"
              }
            ]
          }
        },
        {
          "id": "nm0000210",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "ad7a1362-37a8-43c7-8985-abb49394eb46",
                "value": "Julia Roberts"
              }
            ]
          }
        }
      ]
    }
  ]
}
--- result_above ---
file written: tmp/query_path_1520763836.json
