function: query
endpoint: wss://cjoakim-cosmos-graph1.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: path
query: g.V('nm0000152').repeat(out().simplePath()).until(hasId('nm0000102')).path().limit(3)
--- result_below ---
{
  "qname": "path",
  "query": "g.V('nm0000152').repeat(out().simplePath()).until(hasId('nm0000102')).path().limit(3)",
  "result_count": 3,
  "result": [
    {
      "labels": [
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "39333657-057a-40d9-ad15-3527084e8ebb",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000178",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "347fc7d2-8164-448a-a352-827b14231c8b",
                "value": "Diane Lane"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "0a414d67-4be1-48c2-8ab6-289e269182ed",
                "value": "Kevin Bacon"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "39333657-057a-40d9-ad15-3527084e8ebb",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000210",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "ad7a1362-37a8-43c7-8985-abb49394eb46",
                "value": "Julia Roberts"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "0a414d67-4be1-48c2-8ab6-289e269182ed",
                "value": "Kevin Bacon"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "39333657-057a-40d9-ad15-3527084e8ebb",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000250",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "cec6b866-a6a4-47e9-a0ac-d48e55b364b8",
                "value": "Ren\u00e9e Zellweger"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "0a414d67-4be1-48c2-8ab6-289e269182ed",
                "value": "Kevin Bacon"
              }
            ]
          }
        }
      ]
    }
  ]
}
--- result_above ---
file written: tmp/query_path_1520763838.json
