function: query
endpoint: wss://cjoakim-cosmos-graph1.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: path
query: g.V('nm0000152').repeat(out().simplePath()).until(hasId('nm0001742')).path().limit(3)
--- result_below ---
{
  "qname": "path",
  "query": "g.V('nm0000152').repeat(out().simplePath()).until(hasId('nm0001742')).path().limit(3)",
  "result_count": 3,
  "result": [
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "39333657-057a-40d9-ad15-3527084e8ebb",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000166",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "eed608e6-f33a-4e13-a33f-5376fb7ec224",
                "value": "Helen Hunt"
              }
            ]
          }
        },
        {
          "id": "nm0000158",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "b63169ef-8189-441d-8d6f-c405147b42c9",
                "value": "Tom Hanks"
              }
            ]
          }
        },
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "7f1ff849-86d0-47f6-84ae-015e787a04b7",
                "value": "Lori Singer"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "39333657-057a-40d9-ad15-3527084e8ebb",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000178",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "347fc7d2-8164-448a-a352-827b14231c8b",
                "value": "Diane Lane"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "0a414d67-4be1-48c2-8ab6-289e269182ed",
                "value": "Kevin Bacon"
              }
            ]
          }
        },
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "7f1ff849-86d0-47f6-84ae-015e787a04b7",
                "value": "Lori Singer"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "39333657-057a-40d9-ad15-3527084e8ebb",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000191",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "e9a9ed2a-272e-446a-b2b7-1a0765f192f9",
                "value": "Ewan McGregor"
              }
            ]
          }
        },
        {
          "id": "nm0000158",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "b63169ef-8189-441d-8d6f-c405147b42c9",
                "value": "Tom Hanks"
              }
            ]
          }
        },
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "7f1ff849-86d0-47f6-84ae-015e787a04b7",
                "value": "Lori Singer"
              }
            ]
          }
        }
      ]
    }
  ]
}
--- result_above ---
file written: tmp/query_path_1520765467.json
