function: query
endpoint: wss://cjoakim-cosmos-graph1.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: path
query: g.V('nm0000178').repeat(out().simplePath()).until(hasId('nm0001742')).path().limit(3)
--- result_below ---
{
  "qname": "path",
  "query": "g.V('nm0000178').repeat(out().simplePath()).until(hasId('nm0001742')).path().limit(3)",
  "result_count": 3,
  "result": [
    {
      "labels": [
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000178",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "347fc7d2-8164-448a-a352-827b14231c8b",
                "value": "Diane Lane"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "0a414d67-4be1-48c2-8ab6-289e269182ed",
                "value": "Kevin Bacon"
              }
            ]
          }
        },
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "7f1ff849-86d0-47f6-84ae-015e787a04b7",
                "value": "Lori Singer"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000178",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "347fc7d2-8164-448a-a352-827b14231c8b",
                "value": "Diane Lane"
              }
            ]
          }
        },
        {
          "id": "nm0005260",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "a7694ce6-ec34-4f4a-9f59-31bf23068d51",
                "value": "Frankie Muniz"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "0a414d67-4be1-48c2-8ab6-289e269182ed",
                "value": "Kevin Bacon"
              }
            ]
          }
        },
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "7f1ff849-86d0-47f6-84ae-015e787a04b7",
                "value": "Lori Singer"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000178",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "347fc7d2-8164-448a-a352-827b14231c8b",
                "value": "Diane Lane"
              }
            ]
          }
        },
        {
          "id": "nm0005561",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "08954f85-7300-4576-8f70-dec2e0bb82a9",
                "value": "Luke Wilson"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "0a414d67-4be1-48c2-8ab6-289e269182ed",
                "value": "Kevin Bacon"
              }
            ]
          }
        },
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "7f1ff849-86d0-47f6-84ae-015e787a04b7",
                "value": "Lori Singer"
              }
            ]
          }
        }
      ]
    }
  ]
}
--- result_above ---
file written: tmp/query_path_1520765470.json
