function: query
endpoint: wss://cjoakim-cosmos-graph1.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: person
query: g.V().has('label','person').has('id','nm0001742')
--- result_below ---
{
  "qname": "person",
  "query": "g.V().has('label','person').has('id','nm0001742')",
  "result_count": 1,
  "result": [
    {
      "id": "nm0001742",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "7f1ff849-86d0-47f6-84ae-015e787a04b7",
            "value": "Lori Singer"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_person_1520765423.json
