function: query
endpoint: wss://cjoakim-cosmos-graph1.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: person
query: g.V().has('label','person').has('id','nm0000152')
--- result_below ---
{
  "qname": "person",
  "query": "g.V().has('label','person').has('id','nm0000152')",
  "result_count": 1,
  "result": [
    {
      "id": "nm0000152",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "39333657-057a-40d9-ad15-3527084e8ebb",
            "value": "Richard Gere"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_person_1520763807.json
